In [1]:
import pandas as pd
import numpy  as np

In [2]:
s = pd.Series(
    [7, 15, 4, 4, 7, 4],
    index=['r1', 'r2', 'r3', 'r4', 'r5', 'r6']
)
s

r1     7
r2    15
r3     4
r4     4
r5     7
r6     4
dtype: int64

In [3]:
s.r2

15

In [4]:
s[1]

15

In [5]:
s.values

array([ 7, 15,  4,  4,  7,  4])

In [6]:
s.index

Index(['r1', 'r2', 'r3', 'r4', 'r5', 'r6'], dtype='object')

In [7]:
s.value_counts()

4     3
7     2
15    1
dtype: int64

### DataFrame

In [8]:
df = pd.DataFrame(
    [[1, 8], [3, 4], [5, 9], [7, 2], [2, 6]],
    index=['R1', 'R2', 'R3', 'R4', 'R5'],
    columns=['C1', 'C2']
)
df

    C1  C2
R1   1   8
R2   3   4
R3   5   9
R4   7   2
R5   2   6

In [9]:
df[:3]

    C1  C2
R1   1   8
R2   3   4
R3   5   9

In [10]:
df['C2']

R1    8
R2    4
R3    9
R4    2
R5    6
Name: C2, dtype: int64

In [11]:
df.iloc[2, 1]

9

In [12]:
df.values

array([[1, 8],
       [3, 4],
       [5, 9],
       [7, 2],
       [2, 6]])

In [13]:
df[df < 5]

     C1   C2
R1  1.0  NaN
R2  3.0  4.0
R3  NaN  NaN
R4  NaN  2.0
R5  2.0  NaN

In [14]:
df.head()

    C1  C2
R1   1   8
R2   3   4
R3   5   9
R4   7   2
R5   2   6

In [15]:
df.tail(2)

    C1  C2
R4   7   2
R5   2   6

In [16]:
df.index

Index(['R1', 'R2', 'R3', 'R4', 'R5'], dtype='object')

In [17]:
df.columns

Index(['C1', 'C2'], dtype='object')

In [18]:
df

    C1  C2
R1   1   8
R2   3   4
R3   5   9
R4   7   2
R5   2   6

In [19]:
df.T

    R1  R2  R3  R4  R5
C1   1   3   5   7   2
C2   8   4   9   2   6

In [20]:
df.drop('R3', axis=0)

    C1  C2
R1   1   8
R2   3   4
R4   7   2
R5   2   6

In [21]:
df.drop('C2', axis=1)

    C1
R1   1
R2   3
R3   5
R4   7
R5   2

In [22]:
df.describe()

             C1        C2
count  5.000000  5.000000
mean   3.600000  5.800000
std    2.408319  2.863564
min    1.000000  2.000000
25%    2.000000  4.000000
50%    3.000000  6.000000
75%    5.000000  8.000000
max    7.000000  9.000000

### Other example

In [23]:
df = pd.DataFrame(
    {'x1':[1, 2],
     'x2':[3, 4],
     'x3':[5, 6]})
df

   x1  x2  x3
0   1   3   5
1   2   4   6

In [24]:
data = {
        'Name': ["Ali", "Sara", "Reza", "Taha"],
        'Location' : ["yazd", "Theran", "shiraz", "Hamedan"],
        'Age' : [35, 28, 55, 5]
       }

In [25]:
df = pd.DataFrame(data)
df

   Name Location  Age
0   Ali     yazd   35
1  Sara   Theran   28
2  Reza   shiraz   55
3  Taha  Hamedan    5

In [26]:
df.sort_index(axis=1)

   Age Location  Name
0   35     yazd   Ali
1   28   Theran  Sara
2   55   shiraz  Reza
3    5  Hamedan  Taha

In [27]:
df.sort_index(axis=0, ascending=False)

   Name Location  Age
3  Taha  Hamedan    5
2  Reza   shiraz   55
1  Sara   Theran   28
0   Ali     yazd   35

In [28]:
df.sort_values(by='Age', ascending=False)

   Name Location  Age
2  Reza   shiraz   55
0   Ali     yazd   35
1  Sara   Theran   28
3  Taha  Hamedan    5

In [29]:
df[df.Age < 30]

   Name Location  Age
1  Sara   Theran   28
3  Taha  Hamedan    5

In [30]:
df

   Name Location  Age
0   Ali     yazd   35
1  Sara   Theran   28
2  Reza   shiraz   55
3  Taha  Hamedan    5

In [31]:
df.iloc[2][1]

'shiraz'

In [32]:
df.iloc[1]['Age']

28

In [33]:
pd.DataFrame(np.random.randn(10, 4))

          0         1         2         3
0 -0.352212 -0.268471  0.123283  0.204641
1 -0.262320  1.779810 -1.615813  1.268204
2  0.219614  0.421990 -1.744850 -1.084582
3  0.115776  0.349233 -1.167719 -0.222383
4  1.331700  0.542036  1.258194 -2.371162
5 -0.110493  0.253516 -1.669059 -0.524715
6  0.635260 -0.024214 -1.132021  0.286092
7  0.702849  1.440058  1.240637  0.699604
8  0.809068  1.711213 -0.096156  0.863626
9  1.512322  1.547822 -0.321315 -0.439337